""" Задание №3: Сформировать из введенного числа обратное по порядку входящих в него цифр и вывести
на экран. Например, если введено число 3486, то надо вывести число 6843. """

current_number = input('Здравствуйте! Введите число: ')
print('Введённое Вами число ', current_number, 'в "обратном порядке" (расположение букв реверсом)',
      current_number[::-1])






